LoadTesting/scripts/getAnnotationsForUserBook_Paged_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 1814.963ms, rate sampling interval: 9961ms
  Thread calibration: mean lat.: 1649.925ms, rate sampling interval: 9445ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   201.96ms  112.22ms 972.29ms   72.80%
    Req/Sec   248.95     14.47   303.00     88.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  189.18ms
 75.000%  260.86ms
 90.000%  337.41ms
 99.000%  562.69ms
 99.900%  849.41ms
 99.990%  945.66ms
 99.999%  972.80ms
100.000%  972.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.903     0.000000            1         1.00
      75.135     0.100000        14406         1.11
     108.415     0.200000        28851         1.25
     135.423     0.300000        43227         1.43
     162.175     0.400000        57614         1.67
     189.183     0.500000        72029         2.00
     201.855     0.550000        79227         2.22
     213.759     0.600000        86394         2.50
     228.095     0.650000        93614         2.86
     243.711     0.700000       100845         3.33
     260.863     0.750000       107996         4.00
     270.847     0.775000       111649         4.44
     281.343     0.800000       115265         5.00
     292.607     0.825000       118826         5.71
     305.407     0.850000       122445         6.67
     318.975     0.875000       125997         8.00
     327.679     0.887500       127803         8.89
     337.407     0.900000       129620        10.00
     348.671     0.912500       131395        11.43
     362.495     0.925000       133203        13.33
     378.879     0.937500       135002        16.00
     388.863     0.943750       135905        17.78
     400.127     0.950000       136806        20.00
     413.439     0.956250       137691        22.86
     429.567     0.962500       138598        26.67
     449.535     0.968750       139499        32.00
     460.799     0.971875       139942        35.56
     473.087     0.975000       140398        40.00
     487.935     0.978125       140842        45.71
     504.831     0.981250       141295        53.33
     523.519     0.984375       141748        64.00
     532.479     0.985938       141974        71.11
     542.207     0.987500       142196        80.00
     555.007     0.989062       142424        91.43
     568.319     0.990625       142643       106.67
     585.215     0.992188       142871       128.00
     593.919     0.992969       142979       142.22
     604.159     0.993750       143094       160.00
     619.007     0.994531       143203       182.86
     642.047     0.995313       143316       213.33
     664.575     0.996094       143428       256.00
     683.519     0.996484       143485       284.44
     705.023     0.996875       143541       320.00
     718.847     0.997266       143599       365.71
     730.623     0.997656       143654       426.67
     752.639     0.998047       143710       512.00
     763.391     0.998242       143739       568.89
     783.871     0.998437       143768       640.00
     811.007     0.998633       143794       731.43
     835.583     0.998828       143822       853.33
     850.943     0.999023       143850      1024.00
     864.255     0.999121       143864      1137.78
     877.567     0.999219       143878      1280.00
     886.783     0.999316       143893      1462.86
     898.559     0.999414       143909      1706.67
     906.751     0.999512       143921      2048.00
     910.847     0.999561       143927      2275.56
     912.895     0.999609       143934      2560.00
     915.967     0.999658       143942      2925.71
     917.503     0.999707       143948      3413.33
     922.111     0.999756       143955      4096.00
     926.719     0.999780       143960      4551.11
     928.255     0.999805       143962      5120.00
     931.839     0.999829       143966      5851.43
     933.375     0.999854       143969      6826.67
     941.567     0.999878       143973      8192.00
     944.639     0.999890       143975      9102.22
     945.663     0.999902       143976     10240.00
     952.319     0.999915       143978     11702.86
     957.439     0.999927       143980     13653.33
     960.511     0.999939       143982     16384.00
     962.047     0.999945       143983     18204.44
     962.047     0.999951       143983     20480.00
     963.583     0.999957       143984     23405.71
     964.607     0.999963       143985     27306.67
     966.143     0.999969       143986     32768.00
     967.167     0.999973       143987     36408.89
     967.167     0.999976       143987     40960.00
     967.167     0.999979       143987     46811.43
     969.727     0.999982       143988     54613.33
     969.727     0.999985       143988     65536.00
     972.799     0.999986       143990     72817.78
     972.799     1.000000       143990          inf
#[Mean    =      201.963, StdDeviation   =      112.222]
#[Max     =      972.288, Total count    =       143990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  150241 requests in 5.00m, 27.37MB read
  Socket errors: connect 0, read 0, write 0, timeout 269
Requests/sec:    500.43
Transfer/sec:     93.34KB