LoadTesting/scripts/getAnnotationsForUserBook_Paged_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 128.933ms, rate sampling interval: 467ms
  Thread calibration: mean lat.: 150.399ms, rate sampling interval: 552ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   225.15ms  153.03ms   1.16s    81.37%
    Req/Sec   249.42    422.97     1.30k    80.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  194.43ms
 75.000%  278.53ms
 90.000%  386.05ms
 99.000%  838.14ms
 99.900%    1.07s 
 99.990%    1.14s 
 99.999%    1.15s 
100.000%    1.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.117     0.000000            1         1.00
      79.743     0.100000        14406         1.11
     112.511     0.200000        28820         1.25
     140.543     0.300000        43223         1.43
     167.807     0.400000        57692         1.67
     194.431     0.500000        72029         2.00
     208.767     0.550000        79233         2.22
     224.383     0.600000        86432         2.50
     240.895     0.650000        93633         2.86
     258.815     0.700000       100814         3.33
     278.527     0.750000       108014         4.00
     289.791     0.775000       111646         4.44
     303.359     0.800000       115238         5.00
     317.951     0.825000       118795         5.71
     335.615     0.850000       122422         6.67
     356.351     0.875000       126019         8.00
     370.687     0.887500       127804         8.89
     386.047     0.900000       129591        10.00
     402.687     0.912500       131411        11.43
     423.935     0.925000       133200        13.33
     459.519     0.937500       134996        16.00
     483.583     0.943750       135895        17.78
     511.743     0.950000       136791        20.00
     546.815     0.956250       137701        22.86
     588.799     0.962500       138593        26.67
     632.831     0.968750       139503        32.00
     658.431     0.971875       139942        35.56
     693.247     0.975000       140392        40.00
     721.919     0.978125       140844        45.71
     754.687     0.981250       141292        53.33
     781.823     0.984375       141754        64.00
     794.623     0.985938       141968        71.11
     808.959     0.987500       142191        80.00
     825.855     0.989062       142418        91.43
     846.335     0.990625       142643       106.67
     870.911     0.992188       142871       128.00
     884.223     0.992969       142979       142.22
     901.631     0.993750       143091       160.00
     918.015     0.994531       143217       182.86
     933.375     0.995313       143321       213.33
     959.999     0.996094       143430       256.00
     979.455     0.996484       143484       284.44
     995.839     0.996875       143542       320.00
    1015.295     0.997266       143598       365.71
    1031.167     0.997656       143653       426.67
    1046.015     0.998047       143710       512.00
    1053.695     0.998242       143738       568.89
    1058.815     0.998437       143766       640.00
    1063.935     0.998633       143795       731.43
    1068.031     0.998828       143824       853.33
    1073.151     0.999023       143851      1024.00
    1076.223     0.999121       143864      1137.78
    1081.343     0.999219       143883      1280.00
    1084.415     0.999316       143892      1462.86
    1089.535     0.999414       143909      1706.67
    1092.607     0.999512       143921      2048.00
    1096.703     0.999561       143927      2275.56
    1101.823     0.999609       143934      2560.00
    1106.943     0.999658       143942      2925.71
    1112.063     0.999707       143948      3413.33
    1118.207     0.999756       143955      4096.00
    1124.351     0.999780       143959      4551.11
    1126.399     0.999805       143962      5120.00
    1130.495     0.999829       143966      5851.43
    1136.639     0.999854       143969      6826.67
    1139.711     0.999878       143975      8192.00
    1139.711     0.999890       143975      9102.22
    1140.735     0.999902       143976     10240.00
    1142.783     0.999915       143979     11702.86
    1144.831     0.999927       143981     13653.33
    1145.855     0.999939       143983     16384.00
    1145.855     0.999945       143983     18204.44
    1145.855     0.999951       143983     20480.00
    1147.903     0.999957       143985     23405.71
    1147.903     0.999963       143985     27306.67
    1149.951     0.999969       143987     32768.00
    1149.951     0.999973       143987     36408.89
    1149.951     0.999976       143987     40960.00
    1149.951     0.999979       143987     46811.43
    1151.999     0.999982       143989     54613.33
    1151.999     0.999985       143989     65536.00
    1151.999     0.999986       143989     72817.78
    1151.999     0.999988       143989     81920.00
    1151.999     0.999989       143989     93622.86
    1151.999     0.999991       143989    109226.67
    1151.999     0.999992       143989    131072.00
    1157.119     0.999993       143990    145635.56
    1157.119     1.000000       143990          inf
#[Mean    =      225.146, StdDeviation   =      153.028]
#[Max     =     1156.096, Total count    =       143990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  150066 requests in 5.00m, 27.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 258
Requests/sec:    499.81
Transfer/sec:     93.23KB